[
    {
        "id": 1,
        "filename": "Unqork_PSA_-_BairesDev_EXECUTION_FINAL"
    },
    {
        "id": 2,
        "filename": "Unqork_PSA_-_BairesDev_EXECUTION_FINAL"
    },
    {
        "id": 3,
        "filename": "Unqork_PSA_-_BairesDev_EXECUTION_FINAL"
    },
    {
        "id": 4,
        "user_id": "admin",
        "filename": "Unqork_PSA_-_BairesDev_EXECUTION_FINAL",
        "pretext": "You are a controlling analyst working on behalf of the CONTRACTOR in the contract below. Your task is to read the contract, and extract the information from that contract to fill a spreadsheet.\r\n\r\nSTART OF CONTRACT",
        "posttext": "END OF CONTRACT\r\n\r\nYour response should follow the format in this example:\r\n\r\nStart date: 22-Jul-2024 | Text reference: This Technology Services Agreement (“Agreement”), dated 22-Jul-2024 (the “Effective Date”)\r\n\r\nFrom that, extract this information\r\n\r\n1) How many hours will the teams member perform per day (if 45 per week, answer should be 9, and if 40, answer should be 8): _ | Text reference: _\r\n2) Contractor is allowed to bill vacations (if it says that the rate will not vary, it means a yes): YES/NO | Text reference: _\r\n3) Overtime can be charged at an increased rate? (If yes, express it as a %, like 100% or 150%): _ | Text reference: _\r\n4) What is the minimum engagement period in the \"TECHNOLOGY SERVICES AGREEMENT\" (not the Statement of Work) in months (input only the number): _ | Text reference _\r\n5) What is the minimum engagement period in the \"Statement of work\" in months (input only the number or NA if missing): _ | Text reference: _\r\n6) Is there an administrative fee that charges an extra percentage for reimbursments? If yes, put in the extra percentage, and if not, put a NO: _ | Text reference _\r\n7) Is there a clause stating that there will be an automatic increase in rate/fees or rate adjustment? If so, is it automatic or not: YES/NO | Text reference: _\r\n8) If there is a clause stating that there will be a rate/fees increase or adjustment, how much will it be (it should be something like CPI+5% or +5%): _ | Text reference _\r\n9) The new rate after the increase will be rounded to next largest integer: Larger Integer/NO | Text reference _\r\n10) Is there any special considerations in the rate increase: _\r\n11) Repeat the rate increase clause: _\r\n12) What's the term lenght for the first invoice, i.e the number of days that the client has to pay the contractor: _ | Text reference _\r\n13) What's the term lenght for the every invoice after the first?: _ | Text reference _\r\n14) Is there a clause stating that the contractor can bill the client after the first two weeks?: YES/NO | Text reference _\r\n15) Budget Limitations - Is there a not to exceed amount in any contract? YES/NO | Text reference _\r\n16) Is there a Money Back Guarantee Clause?: YES/NO | Text reference _\r\n17) Is there a clause that allows the the contractor to bill the client in advance?\r\n18) From the Statement of Work, extract the information and return a table of the roles and the rate that will be charged to the client, as well as the number of developers in each role.\r\n19) Is there a clause regarding the backfilling at no cost: Y/N | Text reference _\r\n20) Is there a clause related to a working interview period: Y/N | Text reference _\r\n21) Is there a clause related to a ramp up period: Y/N | Text reference _\r\n22) Is there a clause related to trial period: Y/N | Text reference _\r\n23) Is there a clause related to an \"On call fee\": Y/N | Text reference _\r\n24) Is there a clause or concession that mentions a volume discount: Y/N | Text reference _\r\n25) Is there a clause mentioning a credit or milestone: Y/N | Text reference _\r\n26) Is there a clause regarding the idle time? If yes, is the contractor allowed to bill those idle hours: YES/NO | Text reference _\r\n27) Worked holidays will be billed at regular rate, or at an increased rate: YES/NO | Text reference _\r\n\r\nPlease don't hallucinate, make it clear when you are unsure, and make sure that answer all of the 27 questions I asked.\r\n",
        "summary": "1) How many hours will the teams member perform per day: NA | Text reference: The contract does not specify the number of hours per day or week.\n\n2) Contractor is allowed to bill vacations: NO | Text reference: The contract does not mention billing for vacations.\n\n3) Overtime can be charged at an increased rate: NA | Text reference: The contract does not mention overtime charges.\n\n4) What is the minimum engagement period in the \"TECHNOLOGY SERVICES AGREEMENT\" in months: NA | Text reference: The contract does not specify a minimum engagement period.\n\n5) What is the minimum engagement period in the \"Statement of work\" in months: NA | Text reference: The contract does not include a Statement of Work with a specified minimum engagement period.\n\n6) Is there an administrative fee that charges an extra percentage for reimbursements? NO | Text reference: The contract does not mention an administrative fee for reimbursements.\n\n7) Is there a clause stating that there will be an automatic increase in rate/fees or rate adjustment? NO | Text reference: The contract does not mention an automatic increase in rate/fees or rate adjustment.\n\n8) If there is a clause stating that there will be a rate/fees increase or adjustment, how much will it be: NA | Text reference: The contract does not mention a rate/fees increase or adjustment.\n\n9) The new rate after the increase will be rounded to next largest integer: NO | Text reference: The contract does not mention rounding rates to the next largest integer.\n\n10) Is there any special considerations in the rate increase: NA\n\n11) Repeat the rate increase clause: NA\n\n12) What's the term length for the first invoice: 30 days | Text reference: \"Customer shall pay Consultant for Services within thirty (30) days of the date of Consultant’s invoice.\"\n\n13) What's the term length for every invoice after the first?: 30 days | Text reference: \"Customer shall pay Consultant for Services within thirty (30) days of the date of Consultant’s invoice.\"\n\n14) Is there a clause stating that the contractor can bill the client after the first two weeks?: NO | Text reference: The contract does not mention billing after the first two weeks.\n\n15) Budget Limitations - Is there a not to exceed amount in any contract? NO | Text reference: The contract does not mention a not to exceed amount.\n\n16) Is there a Money Back Guarantee Clause?: YES | Text reference: \"Consultant shall, within ten (10) days of such notice of rejection, refund all fees paid by Customer related to such rejected deliverable.\"\n\n17) Is there a clause that allows the contractor to bill the client in advance? NO | Text reference: The contract does not mention billing the client in advance.\n\n18) From the Statement of Work, extract the information and return a table of the roles and the rate that will be charged to the client, as well as the number of developers in each role: NA | Text reference: The contract does not include a Statement of Work with roles, rates, or number of developers.\n\n19) Is there a clause regarding the backfilling at no cost: NO | Text reference: The contract does not mention backfilling at no cost.\n\n20) Is there a clause related to a working interview period: NO | Text reference: The contract does not mention a working interview period.\n\n21) Is there a clause related to a ramp-up period: NO | Text reference: The contract does not mention a ramp-up period.\n\n22) Is there a clause related to a trial period: NO | Text reference: The contract does not mention a trial period.\n\n23) Is there a clause related to an \"On call fee\": NO | Text reference: The contract does not mention an \"On call fee.\"\n\n24) Is there a clause or concession that mentions a volume discount: NO | Text reference: The contract does not mention a volume discount.\n\n25) Is there a clause mentioning a credit or milestone: NO | Text reference: The contract does not mention a credit or milestone.\n\n26) Is there a clause regarding the idle time? If yes, is the contractor allowed to bill those idle hours: NO | Text reference: The contract does not mention idle time.\n\n27) Worked holidays will be billed at regular rate, or at an increased rate: NA | Text reference: The contract does not mention billing for worked holidays."
    }
]